In [ ]:
"""
Increase the salary of all current employees with bonus by 10% 
(current employees: salaries.to_date='9999-01-01')
"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  emp_bonus; 
drop table if exists  `salaries` ; 

create table emp_bonus(
emp_no int not null,
btype smallint not null);

CREATE TABLE `salaries` (
`emp_no` int(11) NOT NULL,
`salary`  float(11,1) default NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`from_date`));

insert into emp_bonus values(10001,1);

INSERT INTO salaries VALUES(10001,85097,'2001-06-22','2002-06-22');
INSERT INTO salaries VALUES(10001,88958,'2002-06-22','9999-01-01');
INSERT INTO salaries VALUES(10002,80000,'2003-06-22','9999-01-01');

In [ ]:
"""SQL solution"""
UPDATE salaries
SET salary = salary * 1.1
WHERE emp_no IN
(SELECT emp_no FROM emp_bonus)
AND to_date = '9999-01-01'

In [32]:
"""pandas dataframe creation"""
import pandas as pd
import numpy as np

t_eb = np.array([[10001,1]])
t_sal = np.array([[10001,85097,'2001-06-22','2002-06-22'],
                  [10001,88958,'2002-06-22','9999-01-01'],
                  [10002,80000,'2003-06-22','9999-01-01']])

emp_bonus = pd.DataFrame(data=t_eb, columns=['emp_no', 'btype'])
salaries = pd.DataFrame(data=t_sal, columns=['emp_no', 'salary', 'from_date', 'to_date'])
salaries['emp_no'] = salaries['emp_no'].astype('int64')
emp_bonus.head()

   emp_no  btype
0   10001      1

In [33]:
salaries.head()

   emp_no salary   from_date     to_date
0   10001  85097  2001-06-22  2002-06-22
1   10001  88958  2002-06-22  9999-01-01
2   10002  80000  2003-06-22  9999-01-01

In [34]:
salaries = pd.merge(salaries, emp_bonus, on='emp_no', how='left')
salaries

   emp_no salary   from_date     to_date  btype
0   10001  85097  2001-06-22  2002-06-22    1.0
1   10001  88958  2002-06-22  9999-01-01    1.0
2   10002  80000  2003-06-22  9999-01-01    NaN

In [35]:
salaries['salary'] = salaries['salary'].astype('float')
salaries.loc[(salaries['to_date'] == '9999-01-01')&(salaries['btype']), 'salary'] = salaries.loc[(salaries['to_date'] == '9999-01-01')&(salaries['btype']), 'salary']*1.1
salaries[['emp_no', 'salary', 'from_date', 'to_date']]

   emp_no   salary   from_date     to_date
0   10001  85097.0  2001-06-22  2002-06-22
1   10001  97853.8  2002-06-22  9999-01-01
2   10002  80000.0  2003-06-22  9999-01-01